emacs/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mssola's GNU Emacs configuration</title>
<!-- 2017-01-14 Sat 15:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Miquel Sabaté Solà" />
</head>
<body>
<div id="content">
<h1 class="title">mssola's GNU Emacs configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Preface</a></li>
<li><a href="#sec-2">2. Introduction</a></li>
<li><a href="#sec-3">3. General</a>
<ul>
<li><a href="#sec-3-1">3.1. GUI</a></li>
<li><a href="#sec-3-2">3.2. Basic editing configuration</a></li>
<li><a href="#sec-3-3">3.3. Font and theme</a></li>
<li><a href="#sec-3-4">3.4. General global key bindings</a></li>
<li><a href="#sec-3-5">3.5. Others</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Calendar</a></li>
<li><a href="#sec-5">5. General purpose defuns</a></li>
<li><a href="#sec-6">6. Lisp packages</a>
<ul>
<li><a href="#sec-6-1">6.1. Custom packages</a></li>
<li><a href="#sec-6-2">6.2. use-package</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Project</a></li>
<li><a href="#sec-8">8. Edit</a></li>
<li><a href="#sec-9">9. Dired</a></li>
<li><a href="#sec-10">10. Evil</a></li>
<li><a href="#sec-11">11. Magit</a></li>
<li><a href="#sec-12">12. mu4e</a></li>
<li><a href="#sec-13">13. org</a>
<ul>
<li><a href="#sec-13-1">13.1. <span class="todo TODO">TODO</span> shortcut for making an org link, and transforming a link into a proper org link</a></li>
<li><a href="#sec-13-2">13.2. <span class="todo TODO">TODO</span> make it work with evil</a></li>
<li><a href="#sec-13-3">13.3. <span class="todo TODO">TODO</span> Proper keybindings for quick access.</a></li>
</ul>
</li>
<li><a href="#sec-14">14. Languages</a></li>
<li><a href="#sec-15">15. Misc</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preface</h2>
<div class="outline-text-2" id="text-1">
<p>
<a id="sec:preface" name="sec:preface"></a>
</p>

<p>
This is my attempt of getting my configuration organized with literate
programming and <code>org-babel</code>. I took the workflow I'm following from <a href="https://github.com/larstvei">@larstvei</a>.
The idea is that the <code>init.el</code> file will replace itself on the first execution
with the tangled version of this file. This first version will also be
byte-compiled. This means that all changes are to be made on the <code>init.org</code>
file <b>always</b>. The initial contents of the <code>init.el</code> are:
</p>

<div class="org-src-container">

<pre class="src src-elisp">;; We can't tangle without org!
(require 'org)

;; Follow symlinks
(setq vc-follow-symlinks t)

;; Open the configuration
(find-file (concat user-emacs-directory "init.org"))

;; Tangle it
(org-babel-tangle)

;; Load it
(load-file (concat user-emacs-directory "init.el"))

;; Finally byte-compile it
(byte-compile-file (concat user-emacs-directory "init.el"))
</pre>
</div>

<p>
There is no reason to track the init.el file, and no reason to change this
file. In order to ensure this, make sure to apply the following command after
cloning:
</p>

<div class="org-src-container">

<pre class="src src-sh">git update-index --assume-unchanged emacs/init.el
</pre>
</div>

<p>
Moreover, in order to avoid manually tangling and compiling the <code>init.org</code> file
on each change, the following function is provided:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are
  tangled, and the tangled file is compiled. Morever, an init.html is generated."

  (when (or (equal (buffer-file-name)
                   (expand-file-name (concat user-emacs-directory "init.org")))
            (string-suffix-p "dotfiles/emacs/init.org" (buffer-file-name)))

    ;; Avoid running hooks when tangling
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (org-html-export-to-html)
      (byte-compile-file (concat user-emacs-directory "init.el")))))

(add-hook 'after-save-hook 'tangle-init)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
I'm using GNU Emacs 25, but everything should be working in GNU Emacs 24. There
are some exceptions to this (e.g. webkit support), but these cases are
individually handled.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(unless (&gt;= emacs-major-version 24)
  (error "Don't be a cheap bastard and upgrade to at least GNU Emacs 24"))
</pre>
</div>

<p>
Temporarily reduce garbage collection so startup time is lower. Idea taken from
<a href="https://github.com/purcell">@purcell</a>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defconst mssola-initial-gc-cons-threshold gc-cons-threshold
  "Initial value of `gc-cons-threshold' at start-up time.")
(setq gc-cons-threshold (* 1024 1024 1024))
(add-hook 'after-init-hook
          (lambda () (setq gc-cons-threshold mssola-initial-gc-cons-threshold)))
</pre>
</div>

<p>
User name and email.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq user-full-name "Miquel Sabaté Solà"
      user-mail-address "mikisabate@gmail.com")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> GUI</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I like a minimalistic GUI. Because of this, almost all GUI elements have been
disabled or tweaked in some custom way.
</p>

<p>
The frame title is "&lt;login&gt;: &lt;path&gt;". If we are not editing a file, then the
name of the buffer is displayed (e.g. "mssola: <b>scratch</b>").
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq frame-title-format
  '((:eval
    (concat (user-real-login-name) ": "
      (if (buffer-file-name)
        (abbreviate-file-name (buffer-file-name))
        "%b")))))
</pre>
</div>

<p>
Disable the menu, scroll and tool bars. At the same time, enable line and column
modes.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(menu-bar-mode -1)
(when (fboundp 'set-scroll-bar-mode)
  (set-scroll-bar-mode nil))
(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))
(when (fboundp 'tooltip-mode)
  (tooltip-mode 0))

(line-number-mode 1)
(column-number-mode 1)

;; Nice scrolling
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Basic editing configuration</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Use UTF-8 <b>always</b>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-language-environment 'utf-8)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Font and theme</h3>
<div class="outline-text-3" id="text-3-3">
<p>
I'm using "Droid Sans Mono" simply because I've grown used to it.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(set-frame-font "Droid Sans Mono Dotted for Powerline-10")
(add-to-list 'default-frame-alist '(font . "Droid Sans Mono Dotted for Powerline-10"))

; Emacs in daemon mode does not like `set-face-attribute` because this is only
; applied if there is a frame in place, which doesn't happen when starting the
; daemon. Thus, we should call that after the frame has been created (e.g. by
; emacsclient).
; See: https://lists.gnu.org/archive/html/help-gnu-emacs/2015-03/msg00016.html
(add-hook 'after-make-frame-functions-hook
  (lambda ()
    (set-face-attribute 'default t :font "Droid Sans Mono Dotted for Powerline-10")))
</pre>
</div>

<p>
I've hacked my own theme called <a href="https://github.com/mssola/soria">soria</a>. This theme combines the vim theme
<a href="http://www.vim.org/scripts/script.php?script_id=2140">xoria256</a> with the <a href="http://opensuse.github.io/branding-guidelines/">openSUSE branding guidelines</a>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(load-theme 'soria t)
</pre>
</div>
</div>
</div>
