emacs/init.html

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> General global key bindings</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Use kill-this-buffer instead of kill-buffer.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(global-set-key (kbd "C-x k") 'kill-this-buffer)
</pre>
</div>

<p>
Disable C-z. It will later on be picked up by Evil's config as the escape
sequence. This is here to make sure that it will be disabled even if Evil
cannot be loaded due to some error.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(global-unset-key (kbd "C-z"))
</pre>
</div>

<p>
Disable all the Fn keys.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(dotimes (i 12)
  (global-unset-key (kbd (format "&lt;f%d&gt;" (+ i 1)))))
</pre>
</div>

<p>
Disable overwrite-mode.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(define-key global-map [(insert)] nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Others</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Revert buffers automatically when underlying files are changed externally.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(global-auto-revert-mode t)
</pre>
</div>

<p>
Follow symlinks.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq vc-follow-symlinks t)
</pre>
</div>

<p>
Remove the initial message from the scratch buffer.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq initial-scratch-message nil)
</pre>
</div>

<p>
Never kill the scratch buffer, bury it instead.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defadvice kill-buffer (around kill-buffer-around-advice activate)
  (let ((buffer-to-kill (ad-get-arg 0)))
    (if (equal buffer-to-kill "*scratch*")
        (bury-buffer)
      ad-do-it)))
</pre>
</div>

<p>
No backups
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq-default make-backup-files nil)
(setq-default auto-save-default nil)
</pre>
</div>

<p>
No welcome screen
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq-default inhibit-startup-message t)
</pre>
</div>

<p>
Enable y/n answers
</p>

<div class="org-src-container">

<pre class="src src-elisp">(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>

<p>
Let flyspell be performant.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defvar flyspell-issue-message-flag nil)
</pre>
</div>

<p>
Save custom-variables somewhere else.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(if (file-exists-p custom-file)
    (load custom-file))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Calendar</h2>
<div class="outline-text-2" id="text-4">
<p>
We catalans start our weeks on Monday.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defvar calendar-week-start-day 1)
</pre>
</div>

<p>
Global key binding.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(global-set-key (kbd "C-c c") 'calendar)
</pre>
</div>

<p>
Fix some stuff for evil mode.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(with-eval-after-load "evil"
  (evil-set-initial-state 'calendar-mode 'normal)
  (evil-define-key 'normal calendar-mode-map
    "j" 'calendar-forward-week
    "k" 'calendar-backward-week
    "b" 'calendar-backward-day
    "h" 'calendar-backward-day
    "l" 'calendar-forward-day
    "w" 'calendar-forward-day
    "q" 'calendar-exit
    "\C-h" 'evil-window-left
    "\C-l" 'evil-window-right
    "\C-j" 'evil-window-down
    "\C-k" 'evil-window-up
    "\C-n" 'calendar-scroll-left-three-months
    "\C-p" 'calendar-scroll-right-three-months))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> General purpose defuns</h2>
<div class="outline-text-2" id="text-5">
<p>
I want to read the latest news. That's why I define a function that downloads
the <code>NEWS</code> file from the git server and then opens it in a buffer.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun mssola-view-emacs-latest-news ()
  "Allow users to fetch the latest Emacs' NEWS file."
  (interactive)

  (url-copy-file
   "http://git.savannah.gnu.org/cgit/emacs.git/plain/etc/NEWS"
   "/tmp/emacs-news" t)

  (find-file-read-only "/tmp/emacs-news" t))
</pre>
</div>

<p>
Sometimes I want to debug my initialization time.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun emacs-init-time ()
  "Redefine the `emacs-init-time' function so it is more detailed.
Idea taken from @purcell."

  (interactive)
  (let ((init-time
         (float-time (time-subtract after-init-time before-init-time))))
    (message "%.3fs" init-time)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Lisp packages</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Custom packages</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Compile the <code>g.el</code> script and bind it to <kbd>M-g</kbd>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(byte-compile-file (concat user-emacs-directory "lisp/g.el") t)
(global-set-key (kbd "M-g") 'g)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> use-package</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Initialize package.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(require 'package)

(add-to-list 'package-archives
             '("melpa" . "http://melpa.milkbox.net/packages/") t)
(add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/") t)

(package-initialize)
</pre>
</div>

<p>
I'm using use-package to handle my installed packages. I don't know if it's
the best option or what because I haven't tested all the package managers
for Emacs out there. After trying some custom functions to handle
package-install, I decided on use-package because I feel more well-organized.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
</pre>
</div>
</div>
</div>
</div>
