emacs/init.html

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Project</h2>
<div class="outline-text-2" id="text-7">
<p>
First of all, load the silver searcher, which is a convenient and fast searcher.
Ayo silver!
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package ag
  :ensure t
  :config

  ; Avoid some disagreements between ag and evil.
  (with-eval-after-load 'evil
    (add-hook 'ag-mode-hook
              (lambda ()
                (define-key ag-mode-map (kbd "n") 'evil-search-next)
                (define-key ag-mode-map (kbd "N") 'evil-search-previous)
                (define-key ag-mode-map (kbd "gg") 'evil-goto-first-line))))
  (setq ag-reuse-buffers t)
  (setq ag-reuse-window t))
</pre>
</div>

<p>
Then, for keeping up with my projects I use the Projectile + Helm combination.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package projectile
  :ensure t
  :config
  (projectile-mode 1)
  (setq projectile-mode-line
    '(:eval (format " %s" (projectile-project-name)))))

(use-package helm
  :ensure t
  :config
  (setq projectile-completion-system 'helm)

  ; Allow the search pattern to be on the header. Taken from this Reddit thread:
  ; https://www.reddit.com/r/emacs/comments/3asbyn/new_and_very_useful_helm_feature_enter_search/
  (setq helm-echo-input-in-header-line t)

  (defun helm-hide-minibuffer-maybe ()
    "Hide the minibuffer if we are in a Helm session"

    (when (with-helm-buffer helm-echo-input-in-header-line)
      (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
        (overlay-put ov 'window (selected-window))
        (overlay-put ov 'face (let ((bg-color (face-background 'default nil)))
                                `(:background ,bg-color :foreground ,bg-color)))
        (setq-local cursor-type nil))))

  (add-hook 'helm-minibuffer-set-up-hook 'helm-hide-minibuffer-maybe)
  (setq helm-split-window-in-side-p t)

  ; Preview files with tab
  (define-key helm-map (kbd "&lt;tab&gt;") 'helm-execute-persistent-action)

  ; Show available options
  (define-key helm-map (kbd "C-a")  'helm-select-action)

  ; Some vim-like bindings
  (define-key helm-map (kbd "C-j") 'helm-next-line)
  (define-key helm-map (kbd "C-k") 'helm-previous-line)

  (use-package helm-ag
    :ensure t))

(use-package helm-projectile
  :ensure t
  :config
  (helm-projectile-on))
</pre>
</div>

<p>
Finally, I've added a couple of bindings in evil mode. First of all, I want
<kbd>C-p</kbd> to use the proper function for finding files.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun mssola-find-file ()
  "Call the proper Helm function for finding files."

  (interactive)

  (condition-case nil
      (helm-projectile-find-file)
    (error
     (helm-find-files nil))))

(with-eval-after-load 'evil
  (define-key evil-normal-state-map (kbd "C-p") 'mssola-find-file))
</pre>
</div>

<p>
Similarly, <code>helm-ag</code> has two functions for applying <code>ag</code> on the project. I'm
binding to <kbd>,a</kbd> a function that calls to the proper function.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun mssola-helm-ag ()
  "Call the right ag command for helm-ag."

  (interactive)

  (condition-case nil
      (helm-ag-project-root)
    (error (helm-ag))))

(with-eval-after-load 'evil-leader
  (evil-leader/set-key "a" 'mssola-helm-ag))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Edit</h2>
<div class="outline-text-2" id="text-8">
<p>
In this section I define some useful packages for editing. First of all, one of
the coolest packages out there is <code>undo-tree</code>. It allows you to navigate through
the undo history in a tree (because GNU Emacs is cool and keeps track of undo
actions in a tree structure instead of in a stack). This package is included in
recent versions of GNU Emacs.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(with-eval-after-load 'undo-tree
  (global-undo-tree-mode 1)
  (setq undo-tree-visualizer-diff t)
  (setq undo-tree-visualizer-timestamps t)
  (with-eval-after-load 'evil-leader
    (evil-leader/set-key
      "u" 'undo-tree-visualize)))
</pre>
</div>

<p>
Another important package is <code>flycheck</code>, which is a on-the-fly syntax checking
extension. This works with lots of languages with proper glue code.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package let-alist
  :ensure t)

(use-package flycheck
  :ensure t
  :config
  (add-hook 'after-init-hook 'global-flycheck-mode)

  ;; Only show the errors buffer if it isn't there and if I'm saving the
  ;; buffer.
  (setq flycheck-emacs-lisp-load-path 'inherit)
  (setq flycheck-check-syntax-automatically '(mode-enabled save))
  (setq flycheck-display-errors-function
    #'flycheck-display-error-messages-unless-error-list))
</pre>
</div>

<p>
A recurring issue in speeches and presentations is that when showing something
with your editor, you have to increase/decrease the fonts. I use the
<code>default-text-scale</code> package for this.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package default-text-scale
  :ensure t
  :config
  (global-set-key (kbd "C-+") 'default-text-scale-increase)
  (global-set-key (kbd "C--") 'default-text-scale-decrease))
</pre>
</div>

<p>
Some languages use some delimiters a lot (e.g. lisp languages and
parenthesis). For this reason I'm using the <code>rainbow-delimiters</code> package, which
properly highlights each level in a different way (provided that your theme
supports it).
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package rainbow-delimiters
  :ensure t)
</pre>
</div>

<p>
I never use the mouse.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package disable-mouse
  :ensure t
  :config
  (global-disable-mouse-mode))
</pre>
</div>

<p>
Sometimes you begin typing a prefix, but then you forget the following
chord. For this reason <code>which-key</code> was created. It will show the available
commands for the current chord as a list.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package which-key
  :ensure t)
</pre>
</div>

<p>
For some modes it is important to count the number of words in the text. For
this, we have <code>wc-mode</code>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package wc-mode
  :ensure t)
</pre>
</div>

<p>
Next on the list, we have <code>writeroom-mode</code>. I honestly don't use this package
that often, but it's cool to have a distraction-free screen from time to time.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package writeroom-mode
  :ensure t)
</pre>
</div>

<p>
Finally, we have <code>expand-region</code>. This is an extension that is based on a Vim
one, which expands the region of selection with a single key chord. Even if evil
covers most of my uses, it's convenient to have this tool anyways.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package expand-region
  :ensure t
  :config

  ; Set C-e as the expand command (mnemonic: expand). This command will
  ; supercede the evil binding for "move one line", which I never use anyways.
  (global-set-key (kbd "\C-e") 'er/expand-region)
  (with-eval-after-load 'evil
    (define-key evil-normal-state-map (kbd "\C-e") 'er/expand-region)
    (define-key evil-visual-state-map (kbd "\C-e") 'er/expand-region)))

(defun er/add-text-mode-expansions ()
  "This way we can also expand the region into paragraphs &amp; pages in text mode.
Directly taken from: https://github.com/magnars/expand-region.el."

  (make-variable-buffer-local 'er/try-expand-list)
  (setq er/try-expand-list (append
                            er/try-expand-list
                            '(mark-paragraph
                              mark-page))))

(add-hook 'text-mode-hook 'er/add-text-mode-expansions)
</pre>
</div>
</div>
</div>
