emacs/init.org
* Magit

A git porcelain for GNU Emacs. Even if I'm still using the git CLI, it's
certainly useful for some common tasks (I guess that I still need some learning).

#+BEGIN_SRC elisp
  (use-package magit
    :ensure t
    :config

    ; Proper initial states.
    (with-eval-after-load 'evil
      (add-hook 'git-commit-mode-hook 'evil-insert-state)
      (evil-set-initial-state 'magit-log-edit-mode 'insert))

    ; When showing the status, hide the usually-redundant "branch" section and
    ; show the rest.
    (add-hook 'magit-section-set-visibility-hook
              '(lambda (section)
                 (if (string= (magit-section-type section) "branch")
                     'hide
                   'show)))

    (with-eval-after-load 'evil-leader
      (evil-leader/set-key "s" 'magit-status)

      (use-package evil-magit
        :ensure t
        :config

        ; The magit + evil-magit combo messes up some chords, let's fix this.
        (evil-define-key 'normal magit-mode-map
          "\C-h" 'evil-window-left
          "\C-l" 'evil-window-right
          "\C-j" 'evil-window-down
          "\C-k" 'evil-window-up
          "\M-p"  'helm-projectile-switch-project))))
#+END_SRC

