emacs/init.html

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> mu4e</h2>
<div class="outline-text-2" id="text-12">
<p>
I use <a href="http://www.djcbsoftware.nl/code/mu/">mu</a> and <a href="http://www.djcbsoftware.nl/code/mu/mu4e.html">mu4e</a> to manage my email. The configuration for this has been taken
mainly from the documentation, plus some cool remarks on Reddit. This
configuration makes quite some assumptions. Read the <code>emacs/README.org</code> file as
provided in my <code>dotfiles</code> project to get more details.
</p>

<p>
I'm using an RPM that I've built on <a href="https://build.opensuse.org/package/show/home:mssola/mu">OBS</a> which installs mu4e globally.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
(require 'mu4e)

(when (featurep 'mu4e)
</pre>
</div>

<p>
Diferent SMTP options that will be used for each context.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq message-send-mail-function 'smtpmail-send-it
      mu4e-maildir (expand-file-name "~/.mail")
      starttls-use-gnutls t)
</pre>
</div>

<p>
After that, I am defining some functions that will be used in various parts of
the configuration.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun mssola-smtp (server port)
  "Set SMTP variables depending on the given SERVER and PORT."

  (require 'smtpmail)

  (setq smtpmail-starttls-credentials
        '((server port nil nil))
        smtpmail-auth-credentials
        (expand-file-name "~/.authinfo.gpg")
        smtpmail-default-smtp-server server
        smtpmail-smtp-server server
        smtpmail-smtp-service port))

;; Define the different accounts that I'm using. This is only available since
;; mu 0.9.16.

; https://www.reddit.com/r/emacs/comments/47t9ec/share_your_mu4econtext_configs/d0fsih6
(defun mu4e-message-maildir-matches (msg rx)
  (when rx
    (if (listp rx)
        ;; if rx is a list, try each one for a match
        (or (mu4e-message-maildir-matches msg (car rx))
            (mu4e-message-maildir-matches msg (cdr rx)))
      ;; not a list, check rx
      (string-match rx (mu4e-message-field msg :maildir)))))

(defun suse-refile-folder (key)
  "Returns the refile folder for the given SUSE account in the KEY arg"
  (concat "/" key "/Archives/"
          (format-time-string "%Y" (current-time))))
</pre>
</div>

<p>
Now it's time to define the different contexts that I have. Defining contexts
this way is relatively new (since mu 0.16).
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-contexts
      `(
        ;; GMail
        ,(make-mu4e-context
          :name "gmail"
          :enter-func (lambda ()
                        (mu4e-message "Switching to gmail.com")
                        (mssola-smtp "smtp.gmail.com" 587))
          :match-func (lambda (msg)
                        (when msg
                          (mu4e-message-maildir-matches msg "^/gmail")))
          :vars '(
                  (user-mail-address     . "mikisabate@gmail.com")
                  (mu4e-reply-to-address . "mikisabate@gmail.com")
                  (mu4e-drafts-folder    . "/gmail/Drafts")
                  (mu4e-sent-folder      . "/gmail/Sent")
                  (mu4e-refile-folder    . "/gmail/All")
                  (mu4e-trash-folder     . "/gmail/Trash")))

        ;; suse.com
        ,(make-mu4e-context
          :name "comsuse"
          :enter-func (lambda ()
                        (mu4e-message "Switching to suse.com")
                        (mssola-smtp "smtp.novell.com" 25))
          :match-func (lambda (msg)
                        (when msg
                          (mu4e-message-maildir-matches msg "^/susecom")))
          :vars `(
                  (user-mail-address     . "msabate@suse.com")
                  (mu4e-reply-to-address . "msabate@suse.com")
                  (mu4e-drafts-folder    . "/susecom/Drafts")
                  (mu4e-sent-folder      . "/susecom/Sent")
                  (mu4e-refile-folder    . ,(suse-refile-folder "susecom"))
                  (mu4e-trash-folder     . "/susecom/Trash")))

        ;; suse.de
        ,(make-mu4e-context
          :name "desuse"
          :enter-func (lambda ()
                        (mu4e-message "Switching to suse.de")
                        (mssola-smtp "imap.suse.de" 587))
          :match-func (lambda (msg)
                        (when msg
                          (mu4e-message-maildir-matches msg "^/susede")))
          :vars `(
                  (user-mail-address     . "msabate@suse.de")
                  (mu4e-reply-to-address . "msabate@suse.de")
                  (mu4e-drafts-folder    . "/susede/Drafts")
                  (mu4e-sent-folder      . "/susede/Sent")
                  (mu4e-refile-folder    . ,(suse-refile-folder "susede"))
                  (mu4e-trash-folder     . "/susede/Trash")))))
</pre>
</div>

<p>
If mu4e cannot figure things out, ask me.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-context-policy 'ask)
(setq mu4e-compose-context-policy 'ask)
</pre>
</div>

<p>
Fill the <code>mu4e-user-mail-address-list</code> variable with the contexts.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-user-mail-address-list
      (delq nil
            (mapcar (lambda (context)
                      (when (mu4e-context-vars context)
                        (cdr (assq 'user-mail-address
                                   (mu4e-context-vars context)))))
                    mu4e-contexts)))
</pre>
</div>

<p>
Setting my bookmarks
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-bookmarks
      '(("maildir:/gmail/inbox OR maildir:/susecom/inbox OR maildir:/susede/inbox" "Inbox Folders" ?n)
        ("flag:unread AND NOT flag:trashed" "Unread messages" ?u)
        ("date:today..now" "Today's messages" ?t)))
</pre>
</div>

<p>
The following signature looks alright regardless of whether the client supports
format=flowed or not.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-compose-signature
      (concat
       "Miquel Sabaté Solà,\n"
       "PGP: 4096R / 1BA5 3C7A C93D CA2A CFDF DA97 96BE 8C6F D89D 6565\n"))
</pre>
</div>

<p>
Sign outgoing emails always.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(add-hook 'message-send-hook 'mml-secure-message-sign-pgpmime)
</pre>
</div>

<p>
To avoid UID clashes. See <a href="http://pragmaticemacs.com/emacs/fixing-duplicate-uid-errors-when-using-mbsync-and-mu4e/">this</a>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-change-filenames-when-moving t)
</pre>
</div>

<p>
Miscellaneous settings.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-html2text-command "w3m -T text/html"
      mu4e-attachment-dir  "~/Downloads"
      mu4e-headers-date-format "%Y-%m-%d %H:%M"
      message-citation-line-format "%N @ %Y-%m-%d %H:%M %Z:\n"
      message-citation-line-function 'message-insert-formatted-citation-line
      message-kill-buffer-on-exit t
      mu4e-get-mail-command "mbsync -aqV"
      mu4e-update-interval 600
      mu4e-compose-dont-reply-to-self t
      mu4e-compose-format-flowed t
      mu4e-headers-skip-duplicates t
      mu4e-headers-include-related t
      mu4e-headers-auto-update t)
</pre>
</div>

<p>
The headers to show in the headers list a pair of a field and its width,
with `nil' meaning 'unlimited' (better only use that for the last field.
These are the defaults:
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-headers-fields
      '( (:date          .  18)
         (:mailing-list  .  15)
         (:from-or-to    .  20)
         (:subject       .  nil)))
</pre>
</div>

<p>
Show images
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq mu4e-view-show-images t
      mu4e-view-image-max-width 800)

; Use imagemagick, if available
(when (fboundp 'imagemagick-register-types)
  (imagemagick-register-types))
</pre>
</div>

<p>
As of 0.9.18 and GNU Emacs 25, the <code>mu4e-action-with-xwidget</code> can be used to
render an HTML message with Webkit.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(if (&gt;= emacs-major-version 25)
    (add-to-list 'mu4e-view-actions
                 '("webkit" . mu4e-action-view-with-xwidget)))
</pre>
</div>

<p>
Look for mu4e-msg2pdf in the exec path. The reason for this is that that OBS
package installs mu's <code>toys</code> into the exec path, but <code>mu4e</code> doesn't really count
on it.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(let ((exec (locate-file "msg2pdf" exec-path exec-suffixes)))
  (if exec
      (setq mu4e-msg2pdf exec)))
</pre>
</div>

<p>
Adding hooks for composing and viewing messages.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun mssola-compose-mode ()
  "My settings for message composition."

  ; If we are composing an email from scratch, it's more convenient to be in
  ; insert mode. Otherwise start with normal mode.
  (with-eval-after-load 'evil
    (if mu4e-compose-parent-message
        (evil-set-initial-state 'mu4e-compose-mode 'normal)
      (evil-set-initial-state 'mu4e-compose-mode 'insert)))

  ; Guess hard newlines
  (use-hard-newlines t 'guess)

  ; So it's easy to encrypt/decrypt emails.
  (epa-mail-mode)

  ; Spellz
  (flyspell-mode))

(add-hook 'mu4e-compose-mode-hook 'mssola-compose-mode)

; I want to read messages in the format that the sender used. I'm also
; enabling epa-mail-mode, so it's easy to decrypt received emails.
(add-hook 'mu4e-view-mode-hook
          (lambda ()
            (epa-mail-mode)
            (visual-line-mode 1)))
</pre>
</div>

<p>
I want desktop notifications when receiving email.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package mu4e-alert
  :ensure t
  :config

  ; Notify me for unread emails from my inbox.
  (mu4e-alert-set-default-style 'libnotify)
  (add-hook 'after-init-hook #'mu4e-alert-enable-notifications)
  (add-hook 'after-init-hook #'mu4e-alert-enable-mode-line-display)
  (setq mu4e-alert-interesting-mail-query
        (concat
         "(maildir:/gmail/inbox OR maildir:/susecom/inbox OR maildir:/susede/inbox) "
         "AND flag:unread AND NOT flag:trashed"))
  (setq mu4e-alert-email-notification-types '(count)))

; Evil mode in mu4e
(with-eval-after-load 'evil
  (use-package evil-mu4e
    :ensure t
    :config

    ; Idea taken from evil-mu4e.el
    (defvar mssola-evil-mu4e-mode-map-bindings
      `((,evil-mu4e-state mu4e-headers-mode-map "\C-u" evil-scroll-up)
        (,evil-mu4e-state mu4e-main-mode-map    "\C-u" evil-scroll-up)
        (,evil-mu4e-state mu4e-view-mode-map    "h" evil-backward-char)))

    (dolist (binding mssola-evil-mu4e-mode-map-bindings)
      (evil-define-key
        (nth 0 binding) (nth 1 binding) (nth 2 binding) (nth 3 binding)))))
</pre>
</div>

<p>
And finally define a proper shortcut.
</p>

<div class="org-src-container">

<pre class="src src-elisp">; The trailing parenthesis closes the "(when (featurep 'mu4e)" statement from
; the very beginning.
(global-set-key (kbd "C-c m") 'mu4e))
</pre>
</div>
</div>
</div>
