emacs/init.html

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> org</h2>
<div class="outline-text-2" id="text-13">
<p>
First of all, let me define some helper functions.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun mssola-org-skip-if-priority (priority &amp;optional subtree)
  "Skip an agenda item if it has a priority of PRIORITY.
PRIORITY may be one of the characters ?A, ?B, or ?C.
Skips the current entry unless SUBTREE is not nil.  This function has been
copied from @aaronbieber."

  (let ((end (if subtree (save-excursion (org-end-of-subtree t))
               (save-excursion (progn (outline-next-heading) (1- (point))))))
        (pri-value (* 1000 (- org-lowest-priority priority)))
        (pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
        end
      nil)))

(defun mssola-org-skip-if-not-closed-in-day (time &amp;optional subtree)
  "Skip entries that were not closed in the given TIME.
Skip the current entry unless SUBTREE is not nil, in which case skip
the entire subtree.  Idea taken from @aaronbieber"

  (let ((end (if subtree (save-excursion (org-end-of-subtree t))
               (save-excursion (progn (outline-next-heading) (1- (point))))))
        (day-prefix (format-time-string "%Y-%m-%d" time)))

    (if (save-excursion
          (and (re-search-forward org-closed-time-regexp end t)
               (string= (substring (match-string-no-properties 1) 0 10) day-prefix)))
        nil
      end)))
</pre>
</div>

<p>
Some general UI settings for org mode.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-confirm-babel-evaluate nil
      org-edit-src-content-indentation 0)

(setq org-todo-keywords
      '((sequence "TODO(t)"  "|"  "DONE(d!)")
        (sequence "IDEA(i)"  "WORKING(w)"  "|"  "USED(u@/!)"  "DISCARDED(x@/!)")))

(setq org-todo-keyword-faces
      '(("TODO"      . org-todo)
        ("IDEA"      . font-lock-constant-face)
        ("WORKING"   . font-lock-constant-face)
        ("DONE"      . org-done)
        ("USED"      . org-done)
        ("DISCARDED" . org-done)))
</pre>
</div>

<p>
Loggins settings.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq org-log-done t)
(setq org-log-redeadline (quote time))
(setq org-log-reschedule (quote time))
</pre>
</div>

<p>
Where org files reside.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq org-agenda-files '("~/org/"))
</pre>
</div>

<p>
Custom commands for <code>org-agenda</code>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq org-agenda-custom-commands
      '(("p" "Printed agenda"
         ; Daily agenda with a 2-weeks deadline warning. Tasks are
         ; represented as [ ] items.
         ((agenda ""
                  ((org-agenda-ndays 1)
                   (org-deadline-warning-days 14)
                   (org-agenda-todo-keyword-format "[ ]")
                   (org-agenda-scheduled-leaders '("" ""))))

         ; Display a "High Priority" list of tasks on top.
          (tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-sorting-strategy '(tag-up priority-down))
                 (org-agenda-todo-keyword-format "")
                 (org-agenda-overriding-header "\nHigh priority\n--------------\n")))


          ; All tasks except those already listed as high priority or
          ; ideas. Scheduled and deadlines are also ignored here.
          (alltodo ""
                   ((org-agenda-skip-function '(or (mssola-org-skip-if-priority ?A)
                                                   (org-agenda-skip-entry-if 'todo '("IDEA" "WORKING"))
                                                   (org-agenda-skip-if nil '(scheduled deadline))))
                    (org-agenda-sorting-strategy '(tag-up priority-down))
                    (org-agenda-todo-keyword-format "")
                    (org-agenda-overriding-header "\nAll tasks\n----------\n")))

          ; List of ideas.
          (todo "IDEA"
                ((org-agenda-overriding-header "\nIdeas\n------\n")
                 (org-agenda-todo-keyword-format ""))))

         ((org-agenda-compact-blocks t)
          (org-agenda-remove-tags t)))

        ; List of done items. Useful for standups, review meetings, weekly
        ; reports, etc.
        ("d" "Done items"
         ; First show the items done yesterday. Useful for standups.
         ((todo "DONE"
                ((org-agenda-overriding-header "Done yesterday\n---------------\n")
                 (org-agenda-skip-function
                  '(mssola-org-skip-if-not-closed-in-day
                    (time-subtract (current-time) (seconds-to-time 86400))))
                 (org-agenda-todo-keyword-format "")))

          ; Then show what I've done today.
          (todo "DONE"
                ((org-agenda-overriding-header "\nDone today\n-----------\n")
                 (org-agenda-skip-function
                  '(mssola-org-skip-if-not-closed-in-day
                    (current-time)))
                 (org-agenda-todo-keyword-format "")))

          ; Finally show what I've been doing in the past 15 days. Useful for
          ; review meetings and weekly reports.
          (todo "DONE"
                ((org-agenda-start-day "-15d")
                 (org-agenda-span 15)
                 (org-agenda-start-on-weekday nil)
                 (org-agenda-todo-keyword-format "")
                 (org-agenda-scheduled-leaders '("" ""))
                 (org-agenda-overriding-header "\nDone during the past 15 days\n-----------------------------\n"))))

         ((org-agenda-compact-blocks t)
          (org-agenda-remove-tags t)))))
</pre>
</div>

<p>
The prefix for the different kinds of types being used.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq org-agenda-prefix-format '((agenda . "%t%s")
                                 (tags   . "%c:%s")
                                 (todo   . "%c:%t%s")))
</pre>
</div>

<p>
Insert a &lt;kbd&gt;&lt;/kbd&gt; value in org mode. See this <a href="http://emacs.stackexchange.com/questions/2206/i-want-to-have-the-kbd-tags-for-my-blog-written-in-org-mode">StackExchange answer</a>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun endless/insert-key (key)
  "Ask for a key then insert its description.
Will work on both org-mode and any mode that accepts plain html."
  (interactive "kType key sequence: ")
  (let* ((is-org-mode (derived-mode-p 'org-mode))
         (tag (if is-org-mode
                  "@@html:&lt;kbd&gt;%s&lt;/kbd&gt;@@"
                "&lt;kbd&gt;%s&lt;/kbd&gt;")))
    (if (null (equal key "\r"))
        (insert
         (format tag (help-key-description key nil)))
      (insert (format tag ""))
      (forward-char (if is-org-mode -8 -6)))))

(define-key org-mode-map "\C-ck" #'endless/insert-key)
</pre>
</div>
</div>

<div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> <span class="todo TODO">TODO</span> shortcut for making an org link, and transforming a link into a proper org link</h3>
</div>
<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> <span class="todo TODO">TODO</span> make it work with evil</h3>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> <span class="todo TODO">TODO</span> Proper keybindings for quick access.</h3>
</div>
</div>
