emacs/init.html

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Languages</h2>
<div class="outline-text-2" id="text-14">
<p>
First of all, define a function that identifies some warning keywords
(e.g. TODO). This function can then be applied to the proper mode.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun warnings-mode-hook ()
  "Hook for enabling the warning face on strings with a warning prefix."

  (font-lock-add-keywords nil
    '(("\\(XXX\\|FIXME\\|TODO\\|HACK\\|NOTE\\)"
    1 font-lock-warning-face prepend))))
</pre>
</div>

<p>
Text mode is not a programming language, but it's used quite often in this
context too. In this case, I want spell check and <code>wc-mode</code> activated.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(add-hook 'text-mode-hook
          (lambda ()
            (flyspell-mode 1)
            (wc-mode 1)))
</pre>
</div>

<p>
Emacs lisp needs <code>rainbow-delimiters</code>, so the amount of parenthesis is less
confusing. Moreover, I'm also enabling <code>eldoc-mode</code> and the aforementioned
<code>warnings-mode-hook</code>.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (eldoc-mode 1)
            (warnings-mode-hook)
            (rainbow-delimiters-mode 1)
            ; https://github.com/jhenahan/emacs.d/blob/master/emacs-init.org#emacs-lisp
            (setq mode-name "ξ")))
</pre>
</div>

<p>
C and C++ only require the <code>warnings-mode-hook</code> function, spell checking for the
comments and the usage of tabs instead of spaces.
</p>

<div class="org-src-container">

<pre class="src src-elisp">; Note that C-common includes languages with a similar syntax of C.
(add-hook 'c-mode-common-hook 'warnings-mode-hook)
(add-hook 'c-mode-common-hook (lambda() (flyspell-prog-mode)))

;; C
(add-hook 'c-mode-hook
  (lambda () (setq indent-tabs-mode t)))

;; C++
(add-hook 'c++-mode-hook
  (lambda () (setq indent-tabs-mode t)))
</pre>
</div>

<p>
Include warning keywords in Ruby.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(add-hook 'ruby-mode-hook 'warnings-mode-hook)
</pre>
</div>

<p>
And now my Go configuration. This includes stuff like the usage of <code>goimports</code>,
<code>gofmt</code> on save, among many other useful things.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(defun mssola-go-mode ()
  "My configuration for Go mode."

  ; Use goimports instead of go-fmt
  (setq gofmt-command "goimports")

  ; Call Gofmt before saving
  (add-hook 'before-save-hook 'gofmt-before-save)

  ; Integration flycheck with Go
  (add-to-list 'load-path
    (concat (getenv "GOPATH") "/src/github.com/dougm/goflymake"))
  (require 'go-flycheck)

  (evil-leader/set-key
    "." 'godef-jump-other-window)

  (setq indent-tabs-mode t)
  (flyspell-prog-mode)

  ; eldoc support
  (use-package go-eldoc
    :ensure t
    :config
    (require 'go-eldoc))

  (use-package go-add-tags
    :ensure t
    :config
    (evil-leader/set-key "t" 'go-add-tags)))

;; Go
(use-package go-mode
  :ensure t
  :pin melpa-stable
  :config

  (add-hook 'go-mode-hook 'warnings-mode-hook)
  (add-hook 'go-mode-hook 'go-eldoc-setup)
  (add-hook 'go-mode-hook 'mssola-go-mode))
</pre>
</div>

<p>
Tabs or spaces? <a href="https://www.emacswiki.org/emacs/TabsSpacesBoth">Both</a>. The <code>smart-tabs-mode</code> has the philosophy of: tabs for
indentation, spaces for alignment. This is only applied in languages where I'm
usings tabs for indentation (C, C++ and Go).
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package smart-tabs-mode
  :ensure t
  :config
  (smart-tabs-add-language-support golang go-mode-hook
    ((c-indent-line . c-basic-offset)
     (c-indent-region . c-basic-offset)))
  (smart-tabs-insinuate 'c 'c++ 'golang))
</pre>
</div>

<p>
Inferior markup languages.
</p>

<div class="org-src-container">

<pre class="src src-elisp">;; Markdown mode with preview mode in the browser.
(use-package markdown-mode
  :ensure t
  :config

  ; This is the one that I got from openSUSE.
  (custom-set-variables
    '(markdown-command "/usr/bin/markdown-calibre"))

  ; Preview mode does its things through websockets, so it's a requirement.
  ; After that, we can safely require it.
  (use-package websocket
    :ensure t
    :config
    (use-package markdown-preview-mode
      :ensure t)))

; YAML
(use-package yaml-mode
  :ensure t
  :config

  (add-hook 'yaml-mode-hook 'warnings-mode-hook))
</pre>
</div>

<p>
Web-related stuff.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package slim-mode
  :ensure t)

(use-package scss-mode
  :ensure t
  :config

  (setq scss-compile-at-save nil)
  (add-hook 'yaml-mode-hook 'warnings-mode-hook))

(use-package php-mode
  :ensure t)

(use-package web-mode
  :ensure t
  :config

  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.jinja\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))

  (add-hook 'web-mode-hook
            (lambda ()
              (setq web-mode-markup-indent-offset 2)
              (setq web-mode-css-indent-offset 2)
              (setq web-mode-code-indent-offset 2))))
</pre>
</div>

<p>
CMake for y'all.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package cmake-mode
  :ensure t
  :config

  (setq auto-mode-alist
        (append
         '(("CMakeLists\\.txt\\'" . cmake-mode))
         '(("\\.cmake\\'" . cmake-mode))
         auto-mode-alist))

  (use-package cmake-font-lock
    :ensure t
    :config

    (add-hook 'cmake-mode-hook 'cmake-font-lock-activate)
    (add-hook 'yaml-mode-hook 'warnings-mode-hook)))
</pre>
</div>

<p>
Some devops stuff, like Docker, terraform, etc. I have salt-mode disabled for
now because it's buggy, but I still have hope.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package dockerfile-mode
  :ensure t
  :config

  (add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode)))

(use-package terraform-mode
  :ensure t
  :config

  (terraform-format-on-save-mode))

(use-package hcl-mode
  :ensure t)

;(use-package salt-mode
  ;:ensure t)
</pre>
</div>

<p>
The <i>soria</i> theme has the <code>soria-purple-identifiers</code> hook. This hook instructs
the theme to use purple for identifiers instead of the default color. This is a
remnant from my Vim times, and I only apply it to some languages (random
criteria really).
</p>

<div class="org-src-container">

<pre class="src src-elisp">(dolist (lang-hook '(ruby-mode-hook
                     php-mode-hook
                     perl-mode-hook
                     emacs-lisp-mode-hook))
  (add-hook lang-hook 'soria-purple-identifiers))
</pre>
</div>

<p>
Last but not least, <code>YASnippet</code>. This package allows people to define shortcuts
for writing some common blocks.
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package yasnippet
  :ensure t
  :config
  (yas-reload-all)
  (add-hook 'prog-mode-hook #'yas-minor-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Misc</h2>
<div class="outline-text-2" id="text-15">
<p>
Install a set of useful functions from <a href="https://github.com/bbatsov">@bbatsov</a>. The bindings are following
Emacs style instead of being more Vim-like on purpose (I don't want to put
too many things into my leader and these shortcuts look sensible to me).
</p>

<div class="org-src-container">

<pre class="src src-elisp">(use-package crux
  :ensure t
  :bind (("C-c d" . crux-delete-file-and-buffer)
         ("C-c r" . crux-rename-file-and-buffer)
         ("C-c i" . crux-find-user-init-file)
         ("C-c o" . crux-open-with)))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Miquel Sabaté Solà</p>
<p class="date">Created: 2017-01-14 Sat 15:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
